# Taps
tap 'buo/cask-upgrade'
tap 'koekeishiya/formulae'
tap 'noahgorstein/tap'

# Binaries
brew 'ack'
brew 'bash'
brew 'bash-completion@2'
brew 'bat'
brew 'btop'
brew 'docker'
brew 'eza'
brew 'findutils'
brew 'fd'
brew 'fzf'
brew 'gawk'
brew 'git'
brew 'git-extras'
brew 'git-delta'
brew 'git-flow'
brew 'git-lfs'
brew 'gnu-sed'
brew 'grep'
brew 'hub'
brew 'oh-my-posh'
brew 'lazygit'
brew 'jq'
brew 'jq'
brew 'mackup'
brew 'mas'
brew 'node'
brew 'nvim'
brew 'openssh'
brew 'p7zip'
brew 'parallel'
brew 'pigz'
brew 'pv'
brew 'pyenv'
brew 'ripgrep'
brew 'screen'
brew 'ssh-copy-id'
brew 'skhd'
brew 'thefuck'
brew 'tlrc'
brew 'tree'
brew 'wget'
brew 'xq'
brew 'yabai'
brew 'yq'
brew 'zinit'
brew 'zopfli'
brew 'zsh'
brew 'zsh-completions'
brew 'zoxide'

# Apps
cask 'angry-ip-scanner'
cask 'bazecor'
cask 'cursor'
cask 'discord'
cask 'drawio'
cask 'firefox@developer-edition'
cask 'kitty'
#cask 'logitech-g-hub'
cask 'obsidian'
cask 'sublime-text'
cask 'visual-studio-code'
cask 'webex'
cask 'zoom'

# Fonts
cask 'font-hack-nerd-font'
cask 'font-meslo-lg-nerd-font'

# Mac App Store
mas 'Serial', id: 877615577
